#+TITLE: Techela - Technology Enhanced Learning and Assessment
#+AUTHOR: John Kitchin

** roster.dat
File containing registered students. This should be the datafile downloaded from fio, although any csv file with the userid in the second column, last name in the third column, and first name in the fourth column will do right now.

This form takes me straight there for 06-625 in the fall. You have to enter your andrewid and password.

[2015-07-29 Wed] this does not work in s3
#+BEGIN_SRC text :tangle roster.html
<HTML><HEAD><TITLE>06-625 Roster</TITLE></HEAD>
<BODY onload="document.forms['foo'].submit();">

<p><form name="foo"
action="https://www.as.cmu.edu/fio/proc.formproc"
method="post" <br />
<input type="hidden" name="VAR1" value="Fall 2015, 06625 A, CHMCL & REACTV SYSTM"><br />
<input type="hidden" name="ARGNUM" value=4>
<input type="hidden" name="FUNCNAME" value="run_datafile">
<input type="hidden" name="VAR2" value="screen"><br />
<input type="hidden" name="VAR3" value="FULL"><br />
<input type="submit" name="submit" value="Submit"><br />
</form></p>

</HTML>
#+END_SRC

#+BEGIN_SRC emacs-lisp
(org-babel-tangle)
(browse-url "roster.html")
#+END_SRC

#+RESULTS:
: #<process open roster.html>

When you change the roster, you need to run elisp:ta-update-roster which will automatically update students.conf, and roster.org

